xchetah/TCMCode/stm32/Projects/TC1126Only/TC1126s_reg.h
typedef union
{
    unsigned short PerdRegConf;
    struct {
        unsigned short PERD_PERIOD  :12;    // Bit11:0,  Period[11:0]
    } PerdReg_t;
} Reg39BitDef;


typedef union
{
    unsigned short ProbRegConf;
    struct {
        unsigned short PROB_PERIOD           :8;   // Bit7:0,   time_period[19:12]
        unsigned short PROB_INTR_MODE        :3; // Bit10:8,  intr_mode[2:0]
        unsigned short PROB_FRAME_REPEAT_ENB :1;  //bit11,frame_repeat
    } ProbReg_t;
} Reg3ABitDef;


typedef union
{
    unsigned short FlenRegConf;
    struct {
        unsigned short FLEN_FRAME_LEN :10;   // Bit9:0,   Frame_Length[9:0]
        unsigned short FLEN_TOUCH_TH1 :2;  //Bit11:10,touch_th1
    } FlenReg_t;
} Reg3BBitDef;


typedef union
{
    unsigned short TthrRegConf;
    struct {
        unsigned short TTHR_TOUCH_TH0     : 8;    //Bit7:0,touch_th0
        unsigned short TTHR_TOUCH_DETECT  : 1;       //Bit8,  touch_detect
        unsigned short TTHR_HOST_ENDIAN   : 2;   //Bit11:10,host_endian
    } TthrReg_t;
} Reg3CBitDef;


typedef union
{
    unsigned short RxcnRegConf;
    struct {
        unsigned short RXCN_RX_CH_SIZE   :5; //Bit4:0, rx_ch_size
        unsigned short RXCN_CLUSTER_SIZE :2; //Bit6:5, cluster_size
        unsigned short RXCN_SCAN_POST    :1;   //Bit7, scan_post
        unsigned short RXCN_FREQ_HOP     :2;   //Bit9:8, freq_hop
        unsigned short RXCN_FREQ_CHIRP   :1;  //Bit10, freq_chip
        unsigned short RXCN_DENOISE_EN   :1;   //Bit11, Denoise_en
        unsigned short RXCN_PHASE_MODE   :2; //Bit13:12, phase_mode
        unsigned short RXCN_PHASE_HOP    :1;  //Bit14, phase_hop
        unsigned short RXCN_FILTER_HALF  :1;   //Bit15, filter_half
    } RxcnReg_t;
} Reg3EBitDef;


typedef union
{
    unsigned short FctlRegConf;
    struct {
        unsigned short DUMMY          : 4;
        unsigned short FCTL_TXCH_NUM  : 5;   // Bit8:4,   TX_CH_NUMBER[4:0]
        unsigned short FCTL_SCAN_MODE : 2; // Bit10:9:  SCAN MODE:(0:LineMode,1:ManualMode,2:AutoMode,3:SleepMode)
        unsigned short FCTL_S_SEL     : 1;   // Bit11,    X Sel
    } FctlReg_t;
} Reg3FBitDef;


typedef union
{
    unsigned short RjctRegConf;
    struct {
        unsigned short RJCT_RJCT_CNT   : 11;  // Bit10:0,  Rjct_cnt[10:0]
        unsigned short RJCT_TIMING_ENB : 1;  // Bit11,    Timing_EN_B
    } RjctReg_t;
} Reg42BitDef;


typedef union
{
    unsigned short RevnRegConf;
    struct {
        unsigned short REVN_DCMP    :   1;  // Bit0,     DCMP
        unsigned short DUMMY        :   4;
        unsigned short REVN_REVISION:   4;   // Bit8:5,   Revision[3:0]
    } RevnReg_t;
} Reg43BitDef;


typedef union
{
    unsigned short DoneRegConf;
    struct {
        unsigned short DONE_BRST_DONE     :1; // Bit0,      Burst Done flag,        Write 1 to clear it
        unsigned short DONE_ADC_DONE      :1;   // Bit1,      ADC converting is done, Write 1 to clear it
        unsigned short DONE_CVI_DONE      :1;    // Bit2,      CVI done; Read Only
        unsigned short DONE_FRM0_READABLE :1;   // Bit3,      Frame0 Readable
        unsigned short DONE_FRM1_READABLE :1;   // Bit4,      Frame1 Readable
        unsigned short DONE_TP_ID         :3;  // Bit7:5,    Touch_Panel ID
    } DoneReg_t;
} Reg44BitDef;


typedef union
{
    unsigned short TxMapToTx16MoreRegConf;
    struct {
        unsigned short TXMAPTO16M_TS16       : 1;        //Bit0, The 17Th Time, Out to TX16
        unsigned short TXMAPTO16M_TS17       : 1;        //Bit1, The 18Th Time, Out to TX16
        unsigned short TXMAPTO16M_TXRXJ_FCAP : 2;   //Bit3:2,  Special_TXRXJ_FCAP
        unsigned short TXMAPTO16M_RXJ_CORD   : 4;   //Bit7:4,  4Bits, Special_RXJ_COORD
        unsigned short TXMAPTO16M_TXJ_CORD   : 5;    //Bit12:8, 4Bits, Special_TXJ_COORD
    } TxMapToTx16MoreReg_t;
} Reg53BitDef;


typedef struct
{
   Reg1FBitDef Reg1FBitDef_t;
   Reg20BitDef Reg20BitDef_t;
   Reg21BitDef Reg21BitDef_t;
   Reg22BitDef Reg22BitDef_t;
   Reg23BitDef Reg23BitDef_t;
   Reg24BitDef Reg24BitDef_t;
   Reg25BitDef Reg25BitDef_t;
   Reg26BitDef Reg26BitDef_t;
   Reg27BitDef Reg27BitDef_t;
   Reg28BitDef Reg28BitDef_t;
   Reg29BitDef Reg29BitDef_t;
   Reg2BBitDef Reg2BBitDef_t;
   Reg2CBitDef Reg2CBitDef_t;
   Reg2DBitDef Reg2DBitDef_t;
   Reg2EBitDef Reg2EBitDef_t;
   Reg30BitDef Reg30BitDef_t;
   Reg32BitDef Reg32BitDef_t;
   Reg33BitDef Reg33BitDef_t;
   Reg34BitDef Reg34BitDef_t;
   Reg35BitDef Reg35BitDef_t;
   Reg36BitDef Reg36BitDef_t;
   Reg37BitDef Reg37BitDef_t;
   Reg39BitDef Reg39BitDef_t;
   Reg3ABitDef Reg3ABitDef_t;
   Reg3BBitDef Reg3BBitDef_t;
   Reg3CBitDef Reg3CBitDef_t;
   Reg3EBitDef Reg3EBitDef_t;
   Reg3FBitDef Reg3FBitDef_t;
   Reg42BitDef Reg42BitDef_t;
   Reg43BitDef Reg43BitDef_t;   
   Reg44BitDef Reg44BitDef_t;
   Reg53BitDef Reg53BitDef_t;
   
}RegTab;



#ifdef CN1100_MAIN_C
  RegTab RegTab_t;

#else
  extern RegTab RegTab_t;
  
#endif
//R02 -e

#endif
